Little Red Riding-Hood

Once upon a time, there lived in a certain village, a little country girl, the prettiest creature was ever seen. Her mother was excessively fond of her; and her grand-mother doated on her much more. This good woman got made for her a little red riding-hood; which became the girl so extremely well, that every body called her Little Red Riding-Hood.

One day, her mother, having made some girdle-cakes, said to her:

"Go, my dear, and see how thy grand-mamma does, for I hear she has been very ill, carry her a girdle-cake, and this little pot of butter."

Little Red Riding-Hood set out immediately to go to her grand-mother, who lived in another village. As she was going thro' the wood, she met with Gaffer Wolf, who had a very great mind to eat her up, but he durst not, because of some faggot-makers hard by in the forest.

He asked her whither she was going. The poor child, who did not know that it was dangerous to stay and hear a Wolf talk, said to him:

"I am going to see my grand-mamma, and carry her a girdle-cake, and a little pot of butter, from my mamma."

"Does she live far off?" said the Wolf.

"Oh! ay," answered Little Red Riding-Hood, "it is beyond that mill you see there, at the first house in the village."

"Well," said the Wolf, "and I'll go and see her too: I'll go this way, and you go that, and we shall see who will be there soonest."

The Wolf began to run as fast as he could, taking the nearest way; and the little girl went by that farthest about, diverting herself in gathering nuts, running after butterflies, and making nosegays of such little flowers as she met with. The Wolf was not long before he got to the old woman's house: he knocked at the door, tap, tap.

"Who's there?"

"Your grand-child, Little Red Riding-Hood," replied the Wolf, counterfeiting her voice, "who has brought you a girdle-cake, and a little pot of butter, sent you by mamma."

The good grand-mother, who was in bed, because she found herself somewhat ill, cry'd out:

"Pull the peg, and the bolt will fall."

The Wolf pull'd the peg, and the door opened, and then presently he fell upon the good woman, and ate her up in a moment; for it was above three days that he had not touched a bit. He then shut the door, and went into the grand-mother's bed, expecting Little Red Riding-Hood, who came some time afterwards, and knock'd at the door, tap, tap.

"Who's there?"

Little Red Riding-Hood, hearing the big voice of the Wolf, was at first afraid; but believing her grand-mother had got a cold, and was hoarse, answered:

"'Tis your grand-child, Little Red Riding-Hood, who has brought you a girdle-cake, and a little pot of butter, mamma sends you."

The Wolf cried out to her, softening his voice as much as he could, "Pull the peg, and the bolt will fall."

Little Red Riding-Hood pulled the peg, and the door opened. The Wolf seeing her come in, said to her, hiding himself under the bedclothes:

"Put the cake, and the little pot of butter upon the bread-bin, and come and lye down with me."

Little Red Riding-Hood undressed herself, and went into bed; where, being greatly amazed to see how her grand-mother looked in her night-cloaths, she said to her:

"Grand-mamma, what great arms you have got!"

"That is the better to hug thee, my dear."

"Grand-mamma, what great legs you have got!"

"That is to run the better, my child."

"Grand-mamma, what great ears you have got!"

"That is to hear the better, my child."

"Grand-mamma, what great eyes you have got!"

"It is to see the better, my child."

"Grand-mamma, what great teeth you have got!"

"That is to eat thee up."

And, saying these words, this wicked Wolf fell upon poor Little Red Riding-Hood, and ate her all up.







Little Red Cap
Once upon a time there was a sweet little maiden. Whoever laid eyes upon
her couldn’t help but love her. But it was her grandmother who could
never give the child enough. One day she made her a present, a small, red
velvet cap, and since it was so becoming and the maiden always wanted to
wear it, people only called her Little Red Cap.
One day her mother said to her: “Come, Little Red Cap, take this piece
of cake and bottle of wine and bring them to your grandmother. She’s sick
and weak, and this will strengthen her. Be nice and good and greet her
from me. Go directly there and don’t stray from the path, otherwise you’ll
fall and break the glass, and your grandmother will get nothing.”
Little Red Cap promised to obey her mother. Well, the grandmother
lived out in the forest, half an hour from the village, and as soon as Little
Red Cap entered the forest, she encountered the wolf. However, Little
Red Cap didn’t know what a wicked sort of an animal he was and was not
afraid of him.
“Good day, Little Red Cap,” he said.
“Thank you kindly, wolf.”
“Where are you going so early, Little Red Cap?”
“To grandmother’s.”
“What are you carrying under your apron?”
“Cake and wine. My grandmother’s sick and weak, and yesterday we
baked this cake so it will help her get well.”
“Where does your grandmother live, Little Red Cap?”
“About a quarter of an hour from here in the forest. Her house is
under the three big oak trees. You can tell it by the hazel bushes,” said
Little Red Cap.
The wolf thought to himself, “What a juicy morsel she’ll be for me!
Now, how am I going to catch her?” Then he said, “Listen, Little Red Cap,
haven’t you seen the beautiful flowers growing in the forest? Why don’t
you look around? I believe you haven’t even noticed how lovely the birds
are singing. You march along as if you were going straight to school in the
village, and yet it’s so delightful out here in the woods!”
Little Red Cap looked around and saw that the sun had broken through
the trees and that the woods were full of beautiful flowers. So she thought
to herself, “If I bring grandmother a bunch of flowers, she’d certainly like
that. It’s still early, and I’ll arrive on time.”
So she plunged into the woods to look for flowers. And each time she
plucked one, she thought she saw another even prettier flower and ran
after it, going deeper and deeper into the forest. But the wolf went straight
to the grandmother’s house and knocked at the door.
“Who’s there?”
“Little Red Cap. I’ve brought you some cake and wine. Open up.”
“Just lift the latch,” the grandmother called. “I’m too weak and can’t
get up.”
The wolf lifted the latch, and the door sprang open. Then he went
straight to the grandmother’s bed and gobbled her up. Next he took her
clothes, put them on along with her nightcap, lay down in her bed, and
drew the curtains.
Meanwhile, Little Red Cap had been running around and looking for
flowers, and only when she had as many as she could carry did she continue on the way to her grandmother. She was puzzled when she found
the door open, and as she entered the room, it seemed so strange inside
that she thought, “Oh, my God, how frightened I feel today, and usually I
like to be at grandmother’s.” Then she went to the bed and drew back the
curtains. There lay her grandmother with her cap pulled down over her
face, giving her a strange appearance.
“Oh, grandmother, what big ears you have!”
“The better to hear you with.”
“Oh, grandmother, what big eyes you have!”
“The better to see you with.”
“Oh, grandmother, what big hands you have!”
“The better to grab you with.”
“Oh, grandmother, what a terribly big mouth you have!”
“The better to eat you with!”
No sooner did the wolf say that than he jumped out of bed and gobbled up poor Little Red Cap. After the wolf had the fat chunks in his
body, he lay down in bed again, fell asleep, and began to snore very loudly.
The huntsman happened to be passing by the house and thought to himself, “The way the old woman’s snoring, you’d better see if something’s
wrong.” He went into the room, and when he came to the bed, he saw
the wolf lying in it. He had been searching for the wolf a long time and
thought that the beast had certainly eaten the grandmother. “Perhaps she
can still be saved,” he said to himself. “I won’t shoot.” So he took some
scissors and cut open the wolf ’s belly. After he made a couple of cuts, he
saw the little red cap shining forth, and after he made a few more cuts, the
girl jumped out and exclaimed, “Oh, how frightened I was! It was so dark
in the wolf ’s body.”
Soon the grandmother emerged alive. Little Red Cap quickly fetched
some large heavy stones, and they filled the wolf ’s body with them. When
he awoke and tried to run away, the stones were so heavy that he fell down
at once and died.
All three were delighted. The huntsman skinned the fur from the wolf.
The grandmother ate the cake and drank the wine that Little Red Cap had
brought. And Little Red Cap thought to herself: “Never again will you
stray from the path by yourself and go into the forest when your mother
has forbidden it.